<template>
  <div style="width: 100%">
    <div class="banner">
      <span class="legal">COMPATIBILITY PROTOCOL</span>
      <span class="privacy">openEuler兼容性协议</span>
    </div>
    <div class="main">
      <p class="title">一、重要提示</p>
      <p class="text">
        1.openEuler兼容性协议（以下简称”本协议“）是开放原子开源基金会（以下简称”测评方“）与申请openEuler兼容性测评的企业（以下简称”申请方“）之间就openEuler兼容性测试测评事宜缔结的具有法律效力的契约。”申请方“点击”我已阅读并同意遵守《openEuler兼容性协议》“，即视为”申请方“同意接受”本协议“条款的约束。如不同意”本协议“，请”申请方“不要点击”我已阅读并同意遵守《openEuler兼容性协议》“，也不得以任何方式使用”测评方“的兼容性标识。
      </p>
      <p class="text">
        2.
        "申请方"在申请openEuler兼容性测评前，请务必审慎阅读、充分理解”本协议“各条款，确认接受”本协议“的全部内容，并按照”openEuler兼容性测试指导“操作。
      </p>
      <p class="text">
        3.
        “测评方”可能会对“本协议”进行修改，修改后的协议“测评方”将通知“申请方”。若“申请方”不同意相关修改，可以纸件或邮件形式提出异议。若“申请方”点击接受修改后的协议或继续申请兼容性测评的，则视为接受修改协议。
      </p>
      <p class="title">二、定义</p>
      <p class="text">
        1. “openEuler”：是指“测评方”孵化及运营的 openEuler开源操作系统项目。
      </p>
      <p class="text">
        2.
        “openEuler产品兼容性规范”：是指“测评方”针对“openEuler”及产品定义的产品兼容性规范，也称Product
        Compatibility Specification（PCS）。
      </p>
      <p class="text">
        3.
        “产品”：是指“申请方”开发、生产、销售或对外提供的使用“openEuler”全部或部分的板卡、整机、发行版软件，以及基于openEuler的商业发行版操作系统
      </p>
      <p class="text">
        4.
        “openEuler兼容性指导”：是指“测评方”发布的指导“产品”进行openEuler兼容性测试和测评的指导手册，包括但不限于《openEuler兼容性测试指导书》以及其他相关指引。
      </p>
      <p class="text">
        5.
        “openEuler兼容性测试”：指“申请方”为确认其“产品”符合“openEuler产品兼容性规范”，根据“openEuler兼容性指导”进行的“产品”功能、兼容性、安全性及性能等方面的测试。
      </p>
      <p class="text">
        6.
        “openEuler兼容性测评”：是指“测评方”对“申请方”的“产品”进行的审核其符合“openEuler产品兼容性规范”的行为。
      </p>
      <p class="text">
        7.
        “openEuler兼容产品”：是指符合“openEuler产品兼容性规范”且通过“openEuler兼容性测评”的“产品”。
      </p>
      <p class="">8. “用户”：是指使用“产品”的任何个人。</p>
      <p class="title">三、兼容性测试及测评</p>
      <p class="text">
        1.
        建议“申请方”确保其“产品”均是“openEuler兼容产品”。为此，建议“申请方”确保其每个型号或版本的“产品”在首次对外分发前均应申请并通过“openEuler兼容性测评”，成为“openEuler兼容产品”。
      </p>
      <p class="text">
        2.
        为了保障“openEuler”生态统一，“测评方”将针对不同的“产品”类型，设置不同的测试及测评要求。“测评方”向“申请方”提供“openEuler产品兼容性规范”及“测试用例”（获取方式见《openEuler兼容性测试指导书》）。
      </p>
      <p class="text">
        3.
        “申请方”必须使用“测评方”提供的“测试用例”，并且遵循“openEuler产品兼容性规范”和
        “openEuler兼容性指导”进行“openEuler兼容性测试”。
      </p>
      <p class="text">
        4.
        为保障“申请方”顺利发布“openEuler兼容产品”，“申请方”应尽早进行“openEuler兼容性测试”并申请“openEuler兼容性测评”。
      </p>
      <p class="text">
        5.
        “申请方”应在待“openEuler兼容性测评”的“产品”首次对外发布前在“测评方”的openEuler兼容性平台提交“openEuler兼容性测评”申请，并完整准确地提交平台所要求的全部信息，包括但不限于待测评“产品”所有相关信息、完整执行的真实测试报告、待测评“产品”将出厂预装软件版本等，并根据“测评方”的要求寄送对应待测评“产品”样品给“测评方”。如待测评“产品”样品因损坏、丢失或因质量等原因导致无法测评，“申请方”应根据“测评方”的要求重新寄送。“申请方”还应向“测评方”提供所有必要的协助及技术支持。“申请方”理解并同意前述“产品”样品在测评阶段由“测评方”按需处置，前述“样品”在测评完成后应返还给“申请方”，
        “申请方”明示不用返还的除外。
      </p>
      <p class="text">
        6. 如果“申请方”认为其向“测评方”提交的信息或寄送“产品”样品需要保密的，
        “申请方”应采取相应的保护措施并以书面形式告知“测评方”其保密性质。对于在“申请方”向“测评方”寄送“产品”样品物流过程中发生的任何信息泄露，“测评方”不承担任何责任。同时，“申请方”向“测评方”寄送“产品”样品时应为“产品”样品购买相应保险或进行物流保价，保价金额不得低于“产品”样品对应商业产品的市场价格。
      </p>
      <p class="text">
        7.
        “测评方”在收到前述所有信息和“产品”样品后，将进行“openEuler兼容性测评”并将结果通知“申请方”，对于不通过项，“申请方”应进行相应修改或向“测评方”申请失败项豁免。对通过“openEuler兼容性测评”的“产品”，“测评方”将向“申请方”就该“产品”授予证书。
      </p>
      <p class="text">
        8.
        “申请方”后续变更“openEuler兼容产品”的软件版本或硬件版本的，每个变更版本的“产品”首次对外发布前，“申请方”应在“测评方”的openEuler兼容性平台再次申请“openEuler兼容性测评”并完整准确地提交平台所要求的全部信息和/或所需的“产品”样品寄送。“测评方”将在收到前述所有信息和“产品”样品后，进行“openEuler兼容性测评”并将结果通知“申请方”，对于不通过项，“申请方”应进行相应修改或向“测评方”申请失败项豁免。
      </p>
      <p class="text">
        9.
        “测评方”可在“openEuler兼容性测评”过程中或通过后按需提出对送测“产品”的复测要求。对“测评方”提出复测要求的“产品”，“申请方”应在收到“测评方”复测要求通知后十个工作日内配合提交复测所需的完整“产品”信息，包括但不限于“产品”样品以及相关软件包等，并提供相应协助。
      </p>
      <p class="text">
        10.
        为了保障“openEuler兼容产品”在使用期间持续符合“openEuler产品兼容性规范”，“申请方”理解并同意，“测评方”在发出书面通知十五（15）日后，将有权对“申请方”生产和销售，并声明符合“openEuler产品兼容性规范”的“产品”的兼容性进行审计，并可向有关第三方权利人披露审计结果。“申请方”同意该审计的重点为“产品”的功能、兼容性、安全性及性能，以确保“申请方”生产和销售的“产品”与通过“openEuler兼容性测评”的“产品”的一致性。“测评方”有权指定第三方代理行使上述审计权利。“申请方”同意配合“测评方”的审计并提供合理的协助。
      </p>
      <p class="text">
        11.
        “测评方”在“本协议”下的工作将由openEuler兼容性SIG组（sig-Compatibility-Infra）进行。openEuler兼容性工作组有权代表“测评方”委托“测评方”认可的第三方机构执行“本协议”下的“openEuler兼容性测评”工作。“测评方”认为被委托的第三方机构在测评过程中存在不符合“本协议”规定情形的，“测评方”有权要求重新测评或撤销该测评结果。在此情况下，无过错的“申请方”需配合“测评方”重新测评以维持在先证书或获得新的证书。
      </p>
      <p class="title">四、兼容性标识使用及信息展示</p>
      <p class="text">
        1. “兼容性标识”是“测评方”享有权利的，供
        “openEuler兼容产品”使用的以表明其已通过测评的商标标识。“测评方”有权决定修改或更新兼容性标识或相关使用指引，修改或更新后的兼容性标识及相关使用指引将在openEuler官网公示。
      </p>
      <p class="text">
        2.
        在“申请方”遵守“本协议”及《openEuler兼容性标识指引》的前提下，“测评方”授予“申请方”一个有限的、无分许可权的、可撤销的商标授权，授权“申请方”在其
        “openEuler兼容产品”及其包装，营销材料上使用openEuler兼容性标识。“申请方”对其“openEuler兼容产品”的硬件或软件版本进行变更的，应根据第三条（兼容性测试及测评）的规定再次测评。“申请方”违反此条的，“测评方”有权撤销“申请方”的证书及兼容性标识的许可，并终止“本协议”。
      </p>
      <p class="text">
        3.
        “测评方”有权展示“openEuler兼容产品”的相关信息（如申请测评的企业、通过兼容性测评的“产品”名称和型号、测评结果等）。
      </p>
      <p class="text">
        4.
        “申请方”授权“测评方”为展示测评企业或测评结果的目的使用其企业名称、logo、“产品”名称、型号、测试及测评结果等相关信息。
      </p>
      <p class="title">五、网络安全与隐私保护</p>
      <p class="text">
        1.
        “申请方”理解并同意“测评方”有权获取并使用“申请方”为进行测评所提交的“产品”测评相关信息以便“测评方”进行测评。
      </p>
      <p class="text">
        2.
        “申请方”理解并同意“测评方”有权获取并使用“申请方”的“openEuler兼容产品”的设备信息，以便“测评方”进行授权验证。
      </p>
      <p class="text">
        3.
        若“申请方”将“openEuler兼容产品”获取的“用户”数据同步至“申请方”的云平台，则“申请方”应提供独立的隐私声明，确保在“用户”同意隐私声明后再获取“用户”数据。就上述数据上传至“申请方”云平台过程中以及后续由此产生的任何纠纷或诉讼，由“申请方”承担全部责任。
      </p>
      <p class="text">
        4.
        “申请方”应确保其寄送的待测评“产品”样品及提交的测试报告中不包含任何“用户”数据。
      </p>
      <p class="text">
        5.
        协议双方充分理解网络安全、个人数据和隐私保护的重要性。双方同意在履行“本协议”项下之义务，或接受“本协议”项下服务之时，双方均应当遵守适用的数据、隐私保护法律法规的规定，尤其是双方应当确保获得和维持了适用法律法规规定下信息相关方足够的同意、授权和准许，用以确保在“本协议”下处理任何最终“用户”个人数据时符合适用法律的规定，包括披露、传播、拦截和删除“用户”个人数据和信息等，否则因此所产生的责任和损失均由该未遵守相关规定一方自行承担。
      </p>
      <p class="title">六、陈述与保证</p>
      <p class="text">
        1.
        “本协议”下“测评方”提供的所有内容，包括但不限于“openEuler产品兼容性规范”、“openEuler兼容性指导”、“测试用例”、兼容性标识，证书等，均“如是”提供，“测评方”不提供任何保证或担保，包括但不限于不侵权、无瑕疵、适销性或适于特定目的的担保。“测评方”也不对“申请方”的“产品”提供任何形式的保证或担保。
      </p>
      <p class="text">
        2.
        “申请方”承诺，其在兼容性测试及测评过程中遵循诚实、合法、善意的原则，其行为不得违反适用的法律法规、不得破坏社会公共秩序及公共道德。特别地，“申请方”保证其提交的与测评相关的所有材料和信息（包括但不限于测试报告，送检样机和相关软件等），均是真实的、准确的、符合实际情况的，无任何隐瞒或欺骗。“申请方”提供的信息不实或弄虚作假的，“测评方”有权立即终止或撤销对“申请方”的“产品”的兼容性测评认定及证书，并终止或撤销对“申请方”的“产品”的兼容性标识许可，甚至立即终止“本协议”。
      </p>
      <p class="text">
        3.
        “申请方”保证其生产销售的“产品”在质量、性能、固件版本、硬件规格等均与送测且通过测评的“产品”保持一致。“申请方”应密切关注并及时在其生产销售的“openEuler兼容产品”中合入“openEuler”发布的最新补丁（合入时间应不晚于该补丁发布后90日内）。“申请方”应保障其“openEuler兼容产品”在生命周期内性能良好并对其提供维保，并维护“测评方”兼容性标识的声誉。
      </p>
      <p class="text">
        4.
        “申请方”理解并同意，“测评方”发放的证书仅表明“申请方”提供的测试报告/送测“产品”符合“openEuler产品兼容性规范”。在任何情况下通过测评或获得证书并不包含“测评方”对送测“产品”或其他“产品”的质量或性能进行明示或默示的担保。
      </p>
      <p class="text">
        5.
        除“本协议”明确规定外，“申请方”保证其不会利用“测评方”的名义宣传推广其产品，更不会采取可能让公众误以为“测评方”已明示或默示认可其产品的性能或质量的方式进行宣传，不论该产品是否是“openEuler兼容产品”。
      </p>
      <p class="text">
        6.
        “申请方”保证其不会以任何形式直接或间接通过行政或者司法程序挑战兼容性标识的有效性，也不得申请注册与兼容性标识相同或近似或含兼容性标识的企业名称、商标、域名、社交媒体账户等。
      </p>
      <p class="title">七、责任限制</p>
      <p class="text">
        1.
        “测评方”不对“申请方”因为测试、未能通过测评、使用或不能使用兼容性标识，通过或未能通过测评的“产品”等原因所引起或导致的损失，包括但不限于任何实际损失、收益损失、预期利润损失，任何特殊的、偶然的、间接的损失承担责任，即使“测评方”被告知该种损害可能发生。除本条规定外，“测评方”在“本协议”下的所承担的所有责任均不超过向“申请方”收取的测评费用。
      </p>
      <p class="text">
        2.
        因“申请方”违反“本协议”的规定使用兼容性标识引起任何纠纷或索赔，“申请方”应负责为“测评方”抗辩并确保“测评方”不因该等纠纷或索赔遭受任何损失。未经“测评方”事先书面同意，“申请方”不得以任何影响“测评方”权利或增加“测评方”义务的方式与第三方达成和解。经“测评方”要求，“申请方”应承担“测评方”为抗辩该索赔抗辩所承担的所有费用，包括但不限于律师费用和诉讼费用，以及与上述相关的索赔判决或和解金额。如“测评方”因前述纠纷或索赔遭受任何损失的，“测评方”保留完整向“申请方”索赔抗辩的权利。
      </p>
      <p class="text">
        3.
        因“申请方”违反“本协议”给“测评方”造成任何损失的，“申请方”应予全部赔偿。
      </p>
      <p class="title">八、其他</p>
      <p class="text">
        1.
        “本协议”自“申请方”点击“我已阅读并同意遵守《openEuler兼容性协议》。”时正式生效并持续有效，除非双方协议一致或协议一方根据“本协议”提前终止“本协议”。“本协议”终止后第二条，第四条的第3-4款，第五到第八条继续有效。“本协议”终止后，除本条所列前述条款继续有效外，“本协议”下的所有许可立即终止。
      </p>
      <p class="text">
        2.
        如任何一方实质违反“本协议”且在接到违反通知后30天内不弥补或弥补后仍不符合“本协议”要求的，另一方有权立即终止“本协议”。该终止不影响终止方根据“本协议”及法律规定享有的其他救济。
      </p>
      <p class="text">
        3.
        不可抗力：由于地震、台风、水灾、火灾、战争以及其它不能预见并对其发生和后果不能预防、不能克服或避免的不可抗力，直接影响“本协议”的履行或者不能按照“本协议”的约定履行时，遇有前述不可抗力的一方在合理时间内向对方报告所发生的不可抗力并提供有关部门的相关证明后，可以免除相关责任。按不可抗力对履行“本协议”影响的程度，由双方协商部分免除履行义务或延期履行。受到不可抗力影响的一方，应尽可能地采取合理行为和适当措施减轻不可抗力对履行“本协议”所造成的影响。
      </p>
      <p class="text">
        4.
        如“本协议”中的任何条款被视为非法或无效，这些条款均不影响“本协议”中的其他条款的法律效力。
      </p>
      <p class="text">
        5.
        除“本协议”明确约定外，未经另一方书面同意，任何一方不得全部或部分地向任何第三方转让其在“本协议”中的权利和（或）义务。
      </p>
      <p class="text">
        6.
        “本协议”中所引述或链接的文档均为“本协议”不可分割的组成部分，与“本协议”正文具有同等法律效力。
      </p>
      <p class="text">
        7.
        “本协议”适用中国法。双方在“本协议”下的任何争议应通过友好协商解决。若30天内无法协商解决的，任何一方均可向“测评方”所在地有管辖权的人民法院起诉。
      </p>
      <p class="text" style="margin-top: 40px">发布日期：2022年4月</p>
    </div>
  </div>
</template>

<script>
export default {
  methods: {
    goHere() {
      window.open("https://www.openeuler.org/zh/community/contribution");
    },
  },
};
</script>

<style lang="less" scoped>
.banner {
  width: 1900px;
  background: url("../assets/images/openEuler_banner.png") center;
  height: 380px;
  position: relative;
  margin: 0 auto;

  .legal {
    position: absolute;
    top: 136px;
    left: 251px;
    font-size: 60px;
    font-family: HuaweiSansMedium, HuaweiSansMedium-Regular;
    font-weight: 400;
    text-align: left;
    color: rgba(0, 47, 167, 0.07);
    line-height: 60px;
  }

  .privacy {
    position: absolute;
    top: 166px;
    left: 251px;
    font-size: 54px;
    font-family: FZLTXIHJW, FZLTXIHJW-Regular;
    font-weight: 400;
    text-align: left;
    color: #000000;
    line-height: 76px;
  }
}

.main {
  width: 880px;
  margin: 40px auto;
  font-family: FZLTHJW FZLTHJW-Regular;
  padding-bottom: 96px;
  text-align: justify;

  .top {
    margin-top: 40px;
    font-size: 14px;
    line-height: 22px;
  }

  .title {
    margin-top: 40px;

    font-size: 18px;
    font-weight: bold;
  }

  .text-first {
    font-size: 14px;
    margin-top: 16px;
    color: #555555;
    line-height: 22px;
  }

  .text {
    font-size: 14px;
    margin-top: 16px;
    color: #555555;
    line-height: 22px;
  }

  .bold {
    font-weight: bold;
    color: #000000;
  }

  .left {
    margin-left: 16px;
  }

  .blue {
    color: #0836aa;
  }
}
</style>